Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: It is the job of the OIDC provider or one of the downstream Quarkus services that this Quarkus application needs to access with the code flow access token to verify it. This is one of the reasons the code flow access tokens are often provided as binary tokens.
ja_jp: それを検証するのは、この Quarkus アプリケーションがコードフローアクセストークンを使用してアクセスする必要がある OIDC プロバイダー、またはダウンストリームの Quarkus サービスのいずれかの役割です。これが、コードフローアクセストークンがバイナリトークンとして提供されることが多い理由の 1 つです。

source: It is the responsibility of the consumer to allow a `credentials-provider-name` property:
ja_jp: `credentials-provider-name` のプロパティを許可するのはコンシューマーの責任です。

source: It is then possible to use jcmd to dump a report of the native memory usage of the Hotspot JVM running your application;
ja_jp: そして、jcmdを使ってアプリケーションを実行しているHotspot JVMのネイティブメモリ使用量のレポートをダンプすることができます;

source: It is therefore possible to implement a bean implementing `PublisherDecorator` for incoming channels, and `SubscriberDecorator` for outgoing channels. Since two APIs are symmetric, you can implement both interfaces in the same bean. These beans are automatically discovered by Quarkus and applied by priority (from the least value to the greatest).
ja_jp: したがって、着信チャネルには `PublisherDecorator` を実装する Bean を、発信チャネルには `SubscriberDecorator` を実装する Bean を実装することが可能です。両方の API は対称的であるため、同じ Bean で両方のインターフェースを実装できます。これらの Bean は Quarkus によって自動的に検出され、優先度 (最小値から最大値へ) に従って適用されます。

source: It is tied to a certain version of the Elasticsearch server: you cannot use a High Level REST Client version 7 to access a server version 6.
ja_jp: これはElasticsearchサーバーの特定のバージョンに縛られています: 高レベルRESTクライアントのバージョン7を使用してサーバーのバージョン6にアクセスすることはできません。

source: It is unnecessary to specify the `@ConfigProperty` annotation because the method name follows the getter method naming conventions (`greeting.name` being the corresponding property) and no default value is required.
ja_jp: メソッド名はゲッターメソッドの命名規則（ `greeting.name` が対応するプロパティ）に従っており、デフォルト値は必要ないため、 `@ConfigProperty` アノテーションを指定する必要はありません。

source: It is used to mark the content that should be rendered but _not parsed_. It starts with the sequence `{|` and ends with the sequence `|}`: `{| <script>if(true){alert('Qute is cute!')};</script> |}`, and could be multi-line.
ja_jp: レンダリングは行うが _パースは行わない_ という内容をマークするために使用されます。これは `{|` and ends with the sequence `|}` というシーケンスで終わり( `{| <script>if(true){alert('Qute is cute!')};</script>|}` 、複数行になる可能性もあります。

source: It is useful to prevent man-in-the-middle attacks and often defaults to `HTTPS` or `LDAPS`.
ja_jp: これは中間者攻撃を防ぐのに役立ち、多くの場合、デフォルトで `HTTPS` または `LDAPS` に設定されます。

source: It is very similar to the Multipart support of RESTEasy and looks like:
ja_jp: RESTEasyのMultipart対応に非常に似ていて、以下のようになります:

source: It is very simple to inject these components. All you need to do is to add the Inject annotation to the field, constructor or method. In the below code we utilize field and constructor injection.
ja_jp: これらのコンポーネントを注入するのは非常に簡単です。必要なのは、フィールド、コンストラクタ、またはメソッドに注入アノテーションを追加するだけです。以下のコードでは、フィールドとコンストラクタの注入を利用しています。

source: It is very simple to inject these components. All you need to do is to add the `@Inject` annotation to the field, constructor or method. In the below code we utilize field and constructor injection.
ja_jp: これらのコンポーネントをインジェクトするのは非常に簡単です。必要なのは、フィールド、コンストラクタ、またはメソッドに `@Inject` アノテーションを追加することだけです。以下のコードでは、フィールドとコンストラクタのインジェクションを利用しています。

source: It is with a bit of emotion that I announce today the release of Quarkus 2.0.0.Alpha1.
ja_jp: 本日、Quarkus 2.0.0.Alpha1のリリースを少しの感慨を持って発表したいと思います。

source: It is worth mentioning that this injection into the test class is not under the control of CDI and happens after CDI has performed any necessary injections into the test class.
ja_jp: テストクラスへのこの注入は CDI の制御下になく、CDI がテストクラスへの必要な注入を実行した後に発生することは言及に値します。

source: It is worth noting that the Quarkus community has been a huge factor for success, by:
ja_jp: 特筆すべきは、Quarkusのコミュニティが成功の大きな要因になっていることです:

source: It made a huge impact on the Java ecosystem and was a game changer for Java application startup performance:
ja_jp: これは Java エコシステムに大きな影響を与え、Java アプリケーションの起動パフォーマンスにとって画期的なものでした。

source: It maintains a full index of specific directories (e.g., the root directory, `META-INF`, and `META-INF/services`).
ja_jp: 特定のディレクトリー (例: ルートディレクトリー、`META-INF`、および `META-INF/services`) の完全なインデックスを維持します。

source: It makes Quarkus OIDC endpoints completely stateless and it is recommended to follow this strategy to achieve the best scalability results.
ja_jp: これにより、Quarkus OIDC エンドポイントは完全にステートレスになり、最高のスケーラビリティー結果を達成するには、このストラテジーに従うことが推奨されます。

source: It makes Quarkus OIDC endpoints completely stateless, and the preferred approach is to follow this strategy to achieve the best scalability results.
ja_jp: これにより、Quarkus OIDC エンドポイントは完全にステートレスになり、最高のスケーラビリティー結果を達成するには、このストラテジーに従うことが推奨されます。

source: It may also be an `@Identifier` value for configuring a programmatically constructed `Guard` or `TypedGuard` that is used declaratively through `@ApplyGuard`. Note that in this case, the `Guard`/`TypedGuard` should *NEVER* be used programmatically, because configuration is applied on creation, which happens lazily, on the first use. This first use must be through `@ApplyGuard`, otherwise configuration would be ignored.
ja_jp: また、`@ApplyGuard` を通じて宣言的に使用される、プログラムで構築された `Guard` または `TypedGuard` を設定するための `@Identifier` 値になる場合もあります。 この場合、設定は作成時に適用され、最初の使用時に遅延実行されるため、`Guard`/`TypedGuard` はプログラムで *決して* 使用してはならないことに注意してください。 この最初の使用は `@ApplyGuard` を介して行う必要があります。そうでない場合、設定は無視されます。

source: It may be necessary to update the already resolved tenant configuration. For example, a client secret may have to be updated following a client secret update in the registered OIDC application.
ja_jp: すでに解決されたテナント設定を更新する必要がある場合があります。たとえば、登録済みの OIDC アプリケーションでクライアントクレデンシャルが更新された場合、クライアントクレデンシャルも更新する必要があるかもしれません。

source: It may declare any of the following return types:
ja_jp: 次の戻り値の型のいずれかを宣言できます。

source: It may happen that some beans from third-party libraries do not work correctly in Quarkus. A typical example is a bean injecting a portable extension. In such case, it's possible to exclude types and dependencies from the bean discovery. The `quarkus.arc.exclude-types` property accepts a list of string values that are used to match classes that should be excluded.
ja_jp: サードパーティーのライブラリーからのいくつかの Bean が Quarkus で正しく動作しないことがあります。典型的な例は、ポータブルエクステンションを注入する Bean です。このような場合は、型や依存関係を Bean の検出から除外することができます。 `quarkus.arc.exclude-types` プロパティーは、除外すべきクラスに一致するために使用される文字列値のリストを受け入れます。

source: It may not be a problem when Quarkus fetches public verification keys from OIDC-compliant providers like the <<google>> provider and keeps verifying the user session with these keys locally. However, for pure OAuth2 providers where only an access token is available and which has to be verified indirectly by requesting UserInfo from the provider endpoint on every request done by an already authenticated user, it can become a problem.
ja_jp: Quarkus が、<<google>> プロバイダーなどの OIDC 準拠のプロバイダーから公開検証鍵を取得し、これらの鍵を使用してユーザーセッションをローカルで検証し続ける場合は問題にならないかもしれませんが、アクセストークンのみが利用でき、認証済みユーザーから要求があるたびに、プロバイダーエンドポイントから UserInfo を要求して間接的に検証する必要があるピュア OAuth2 プロバイダーの場合には問題となる可能性があります。

source: It means that, if you are using JSON, you don't need to add `@Produces` and `@Consumes` annotations anymore.
ja_jp: つまり、JSON を使用している場合は、 `@Produces` と `@Consumes` のアノテーションを追加する必要がなくなります。

source: It might be safer to stop the two containers while you are building the native executable and start them again once you are done.
ja_jp: ネイティブ実行可能ファイルをビルドしている間は2つのコンテナーを停止して、ビルドが終わったら再度起動した方が安全かもしれません。

source: It might be tempting to add a label or tag to the counter indicating what value was checked, but remember that each unique combination of metric name (`example.prime.number`) and label value produces a unique time series. Using an unbounded set of data as label values can lead to a "cardinality explosion", an exponential increase in the creation of new time series.
ja_jp: どのような値がチェックされたかを示すラベルやタグをカウンタに追加したくなるかもしれませんが、メトリック名( `example.prime.number`)とラベル値のユニークな組み合わせは、それぞれユニークな時系列を生成することを覚えておいてください。ラベル値として無制限のデータセットを使用すると、新しい時系列の作成が指数関数的に増加する「カーディナリティ・エクスプロージョン（cardinality explosion）」が発生する可能性があります。

source: It might not always be handy to have the validation rules declared at the end point level as it could duplicate some business validation.
ja_jp: バリデーションルールをエンドポイントレベルで宣言するのは、必ずしも便利とは限りません。ビジネスバリデーションと重複する可能性があるためです。

source: It might so happen that the build gets stalled and even ends up with:
ja_jp: ビルドが停止し、次のような状態で終了する場合もあるかもしれません:

source: It needs to be more than “hello world” but not the “kitchen sink,” picking a set of common capabilities, such as https://en.wikipedia.org/wiki/Representational_state_transfer[REST^], https://en.wikipedia.org/wiki/WebSocket[WebSockets^], database interaction, messaging, https://quarkus.io/guides/smallrye-health[health checks^], https://quarkus.io/guides/micrometer[monitoring/metrics^], https://quarkus.io/guides/kafka-schema-registry-avro[Apache Avro^], and https://quarkus.io/guides/openapi-swaggerui[OpenAPI^] integration.
ja_jp: link:https://en.wikipedia.org/wiki/Representational_state_transfer[REST, window=_blank]、 link:https://en.wikipedia.org/wiki/WebSocket[WebSocket, window=_blank]、データベースとのやりとり、メッセージング、 link:https://quarkus.io/guides/smallrye-health[ヘルスチェック, window=_blank]、 link:https://quarkus.io/guides/micrometer[モニタリング/メトリクス, window=_blank]、 link:https://quarkus.io/guides/kafka-schema-registry-avro[Apache Avro, window=_blank]、 link:https://quarkus.io/guides/openapi-swaggerui[OpenAPI, window=_blank]の統合など、共通の機能をピックアップして、"hello world"以上ではあるが、"kitchen sink"ではないこと

source: It produces several outputs in `/target`:
ja_jp: これは `/target` にいくつかの出力ファイルを生成します。

source: It provides `io.quarkus.test.keycloak.server.KeycloakTestResourceLifecycleManager`, which is an implementation of `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` that starts a Keycloak container.
ja_jp: これは、Keycloak コンテナーを起動する `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` の実装である`io.quarkus.test.keycloak.server.KeycloakTestResourceLifecycleManager` を提供します。

source: It provides a flexible and dynamic authorization capability based on Resource-Based Access Control.
ja_jp: リソースベースアクセスコントロール(RBAC)に基づく柔軟でダイナミックな認可機能を提供します。

source: It provides a way to test:
ja_jp: 以下をテストする方法を提供します。

source: It provides an alternative to `quarkus-oidc` Bearer Token Authentication Mechanism. It can currently verify only `JWT` tokens using the PEM keys or refreshable `JWK` key set.
ja_jp: それは `quarkus-oidc` ベアラートークン認証メカニズムに代わるものを提供します。現在、PEM 鍵または更新可能な `JWK` 鍵セットを使用して `JWT` トークンのみを検証することができます。

source: It relies on a closed-world assumption and removes most runtime dynamism (at least in its current form - work on the GraalVM side could change this in the future). Note: This was not and is not an issue for Quarkus as it makes the same assumption; it can be problematic for third-party libraries.
ja_jp: これはクローズドワールドの仮定に依存し、ほとんどのランタイムダイナミズムを排除します（少なくとも現在の形式では。GraalVM 側の作業によって将来的に変更される可能性はあります）。注記: Quarkus は同じ仮定を置いているため、これは Quarkus にとって問題ではありませんでしたが、サードパーティライブラリにとっては問題となる可能性があります。

source: It sends verified tokens to Keycloak Authorization Services.
ja_jp: 検証されたトークンを Keycloak Authorization Services に送信します。

source: It should be a safe upgrade for anyone already using 2.7 though.
ja_jp: これは、すでに2.7を使用している人にとって安全なアップグレードです。

source: It should be a safe upgrade for anyone already using 3.20.
ja_jp: 3.20 を既に使用している方にとっては、安全なアップグレードとなるはずです。

source: It should be a safe upgrade for anyone already using 3.27.
ja_jp: 3.27 をすでに使用している方にとっては、安全にアップグレードできます。

source: It should be added to the `native-image` configuration using the `quarkus.native.additional-build-args` configuration property as shown in the examples above.
ja_jp: 上記の例のように、`quarkus.native.additional-build-args` 設定プロパティーを使用して `native-image` 設定に追加する必要があります。

source: It should be noted that when using the Spring Web support in Quarkus, link:https://github.com/FasterXML/jackson[Jackson] is automatically added to the classpath and properly set up.
ja_jp: QuarkusでSpring Webサポートを使用する場合、 link:https://github.com/FasterXML/jackson[Jackson] は自動的にクラスパスに追加され、適切に設定されることに注意してください。

source: It should be noted that when using the Spring Web support in Quarkus, link:https://github.com/FasterXML/jackson[Jackson] is automatically added to the classpath and properly setup.
ja_jp: なお、QuarkusでSpring Webサポートを使用する場合、 link:https://github.com/FasterXML/jackson[Jackson]は自動的にクラスパスに追加され、適切に設定されます。

source: It should be transparent for you, except if you have an explicit dependency to Jandex. In this case, while a relocation has been put in place, it is recommended to adjust the `groupId` to `io.smallrye`.
ja_jp: Jandexへの明示的な依存関係がある場合を除き、透過的な変更でしょう。明示的な依存関係がある場合は、再配置が行われているため、 `groupId` を `io.smallrye` に調整することが推奨されます。

source: It should respond something like that...
ja_jp: これは以下のような応答をする筈です.

source: It should retrieve the book content. In the output you should see the separator like:
ja_jp: ブックの内容を取得します。出力には次のようなセパレータが表示されるはずです。

source: It still comes with some exciting stuff:
ja_jp: まだまだワクワクするようなものが付いています。

source: It takes as input the application developed in the xref:getting-started.adoc[Getting Started Guide]. You can find instructions on how to quickly set up this application in this guide.
ja_jp: xref:get-started.adoc[入門ガイド] で開発されたアプリケーションを入力として使用します。 このアプリケーションを素早くセットアップする方法は、このガイドに記載されています。

source: It took a while to get it in but, together with the annotation support for caching we had since a long time, there is now a programmatic API for caching coming with the Cache extension.
ja_jp: 導入には時間がかかりましたが、以前からあったキャッシング用のアノテーションサポートに加え、Cacheエクステンションにはキャッシング用のプログラムAPIが用意されています。

source: It took us only a few months to do the migration, and we started deploying our first OpenShift application with our Quarkus powered _ocpdeploy_ end of last year. Since then, it was used to run hundreds of deployments. We were able to follow the pace of new releases with limited effort. We incurred very few bugs, usually fixed in time for the next release. The applicative framework provided by Quarkus allowed us to better structure our code, making it more maintainable, and easy to tests with mock features and test profiles. It is interesting to note as well that _ocpdeploy_ development was done by team members that were not Quarkus developers, or even strong Java specialists. This is a sign that the framework is light enough that once the overall structure (e.g. components, tests, configuration, ci) is in place, we can forget about it.
ja_jp: 移行に要した期間はわずか数ヶ月で、昨年末にはQuarkusを搭載した _ocpdeploy_で最初のOpenShiftアプリケーションのデプロイを開始しました。それ以来、何百ものデプロイメントを実行するために使用されました。限られた労力で新しいリリースのペースを追うことができました。バグはほとんど発生せず、通常は次のリリースに間に合うように修正されました。Quarkusが提供するアプリケーションフレームワークにより、コードの構造化が進み、保守性が向上し、モック機能やテストプロファイルを使ったテストが容易になりました。 _ocpdeploy_の開発は、Quarkusの開発者ではなく、Javaの専門家でもないチームメンバーによって行われたことも興味深い点です。これは、フレームワークが、全体的な構造（例：コンポーネント、テスト、構成、ci）が整ってしまえば、それを忘れることができるほど軽量であることを示しています。

source: It unifies imperative and reactive. It is a Microservice first toolkit.
ja_jp: インプライベーティブとリアクティブを統一しています。これは、マイクロサービス初のツールキットです。

source: It uses Cloud Build to build your Docker image and deploy it to Google Container Registry (GCR).
ja_jp: Cloud Buildを使用してDockerイメージをビルドし、Google Container Registry(GCR)にデプロイします。

source: It uses Jackson underneath.
ja_jp: これは、水面下で Jackson を使用しています。

source: It uses the `quarkus-oidc` extension to verify bearer tokens.
ja_jp: ベアラートークンを検証するために `quarkus-oidc` エクステンションを使用します。

source: It was already possible to use it with Quarkus 2.11 but GraalVM/Mandrel 22.2 is now the default version for building native executables.
ja_jp: Quarkus 2.11で既に使用可能でしたが、GraalVM/Mandrel 22.2がネイティブ実行可能ファイルをビルドするためのデフォルトバージョンになりました。

source: It will allow to narrow down the number of JAX-RS providers (which can be seen as converters) included in the native executable.
ja_jp: そうすることで、ネイティブ実行可能ファイルに含まれるJAX-RSプロバイダー（コンバーターとも言える）の数を絞ることができます。

source: It will allow to narrow down the number of Jakarta REST providers (which can be seen as converters) included in the native executable.
ja_jp: これにより、ネイティブ実行可能ファイルに含まれるJakarta RESTプロバイダー（コンバーターとも言える）の数を絞ることができるようになります。

source: It will also bring `io.quarkus:quarkus-oidc-client`.
ja_jp: `io.quarkus:quarkus-oidc-client` も追加されます。

source: It will also configure the picocli extension in the `pom.xml`:
ja_jp: また、このコマンドは `pom.xml` にpicocli エクステンションを設定します。

source: It will ask for a `groupId` - let's keep the default `org.acme` - and an extension id - I went for `message-transformers-as-beans`.
ja_jp: `groupId` - デフォルトの `org.acme` - とエクステンションID - `message-transformers-as-beans` を要求されます。

source: It will be auto-replaced in all the source files (.java, .kt, .scala). The package directory will also be automatically adjusted. If for some reason, another type of file needs the user package name then you should use a <<qute-templates>> for it and `{project.package-name}` data placeholder (https://github.com/quarkusio/quarkus/blob/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts/grpc-codestart/base/src/main/proto/hello.tpl.qute.proto#L4[find an example in the grpc proto file, window="_blank"]).
ja_jp: すべてのソースファイル（.java, .kt, .scala）で自動置換されます。また、パッケージディレクトリも自動的に調整されます。何らかの理由で、他の種類のファイルがユーザーパッケージ名を必要とする場合は、そのファイルに link:#qute-templates[qute-templates]を使用し、 `{project.package-name}` データプレースホルダーを使用する必要があります（ link:https://github.com/quarkusio/quarkus/blob/main/devtools/project-core-extension-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts/grpc-codestart/base/src/main/proto/hello.tpl.qute.proto#L4[grpc protoファイルに例があります, window=_blank]）。

source: It will ensure that all Dev UI options described in <<develop-service-applications, Developing OpenID Connect Service Applications>> will be available when your `web-app` application is run in dev mode. The limitation of this approach is that both access and ID tokens returned with the code flow and acquired with Dev UI will be sent to the endpoint as HTTP `Bearer` tokens - which will not work well if your endpoint requires the injection of `IdToken`. However it will work as expected if your `web-app` application only uses the access token, for example, as a source of roles or to get `UserInfo`, even if it is assumed to be a `service` application in devmode.
ja_jp: これにより、開発モードで `web-app` アプリケーションが実行されている際に、<<develop-service-applications, Developing OpenID Connect Service Applications>> で説明されているすべての Dev UI オプションが確実に使用可能なります。このアプローチの制限は、コードフローで返され、Dev UI で取得されたアクセストークンと ID トークンの両方が、HTTP `Bearer` トークンとしてエンドポイントに送信されることです。これは、エンドポイントで `IdToken` の挿入が必要な場合はうまく機能しません。ただし、 `web-app` アプリケーションがアクセストークンのみを使用する場合 (たとえばロールのソースとして、または `UserInfo` の取得に)、devmode の `service` アプリケーションであると想定される場合でも期待どおり機能します。

source: It will ensure that all Dev UI options described in <<develop-service-applications, Developing OpenID Connect Service Applications>> will be available when your `web-app` application is run in dev mode. The limitation of this approach is that both access and ID tokens returned with the code flow and acquired with Dev UI will be sent to the endpoint as HTTP `Bearer` tokens - which will not work well if your endpoint requires the injection of `IdToken`. However, it will work as expected if your `web-app` application only uses the access token, for example, as a source of roles or to get `UserInfo`, even if it is assumed to be a `service` application in dev mode.
ja_jp: これにより、開発モードで `web-app` アプリケーションが実行されている際に、<<develop-service-applications, Developing OpenID Connect Service Applications>> で説明されているすべての Dev UI オプションが確実に使用可能なります。このアプローチの制限は、コードフローで返され、Dev UI で取得されたアクセストークンと ID トークンの両方が、HTTP `Bearer` トークンとしてエンドポイントに送信されることです。これは、エンドポイントで `IdToken` の挿入が必要な場合はうまく機能しません。ただし、 `web-app` アプリケーションがアクセストークンのみを使用する場合 (たとえばロールのソースとして、または `UserInfo` の取得に)、devmode の `service` アプリケーションであると想定される場合でも期待どおり機能します。

source: It will ensure that all Dev UI options described in xref:develop-service-applications[Developing OpenID Connect Service Applications] will be available when your `web-app` application is run in dev mode. The limitation of this approach is that both access and ID tokens returned with the code flow and acquired with Dev UI will be sent to the endpoint as HTTP `Bearer` tokens - which will not work well if your endpoint requires the injection of `IdToken`. However, it will work as expected if your `web-app` application only uses the access token, for example, as a source of roles or to get `UserInfo`, even if it is assumed to be a `service` application in dev mode.
ja_jp: これにより、 `web-app` アプリケーションを dev モードで実行したときに、 xref:develop-service-applications[OpenID Connectサービスアプリケーション開発] で説明したすべての Dev UI オプションが利用できるようになります。このアプローチの限界は、コードフローで返却され、Dev UIで取得されたアクセストークンとIDトークンの両方がHTTP `Bearer` トークンとしてエンドポイントに送信されることです。これは、エンドポイントが `IdToken` の注入を必要とする場合にはうまく機能しません。しかし、 `web-app` アプリケーションが、例えば、ロールソースとして、または `UserInfo` を得るためにアクセストークンを使用するだけの場合は期待通りに機能します。たとえそれが開発モードの `service` アプリケーションと想定されていた場合でもです。

source: It will ensure that if you access the application from the browser in dev mode, without using OIDC DevUI, then Quarkus OIDC will also perform the authorization code flow as in the production mode. But OIDC DevUI will also be more useful because `hybrid` applications can accept the bearer access tokens as well.
ja_jp: これにより、OIDC DevUI を使用せずにブラウザーから開発モードでアプリケーションにアクセスすると、Quarkus OIDC もプロダクション モードと同様に認可コード フローを実行するようになります。 しかし、 `hybrid` アプリケーションはベアラー アクセス トークンも受け入れることができるため、OIDC DevUI もより便利になります。

source: It will install the latest version of the Quarkus CLI.
ja_jp: Quarkus CLI の最新バージョンがインストールされます。

source: It will install the latest version of the Quarkus CLI. Once installed `quarkus` will be in your `$PATH` and if you run `quarkus --version` it will print the installed version:
ja_jp: Quarkus CLI の最新バージョンがインストールされます。インストールされた `quarkus` は `$PATH` に配置され、 `quarkus --version` を実行するとインストールされているバージョンが出力されます。

source: It will install the latest version of the Quarkus CLI. This command can also be used to update the Quarkus CLI.
ja_jp: Quarkus CLI の最新バージョンがインストールされます。このコマンドを使用して、Quarkus CLI を更新することもできます。

source: It will try to auto-detect its options:
ja_jp: オプションの自動検出が試行されます。

source: It won't come as a surprise: you also need to include the AOT cache file in your container image, so Leyden increases the image size.
ja_jp: 驚くことではありませんが、Container Image に AOT キャッシュファイルを含める必要もあるため、Leyden はイメージサイズを増加させます。

source: It works in the exact same way as Quarkus Application configuration file `application.properties`. Recommendation is to use Quarkus `application.properties`.
ja_jp: これは、Quarkus アプリケーション設定ファイル `application.properties` とまったく同じように機能します。Quarkus の `application.properties` を使用することをお勧めします。

source: It works similarly to `OidcClientRequestFilter`. See <<resteasy-client-oidc-filter,Use OidcClient in MicroProfile RestClient client filter>>. It uses `OidcClient` to acquire the access token, refresh it if needed, and set it as an HTTP `Authorization Bearer` scheme value.
ja_jp: `OidcClientRequestFilter` と同様に動作します。<<resteasy-client-oidc-filter,Use OidcClient in MicroProfile RestClient client filter>> を参照してください。`OidcClient` を使用してアクセストークンを取得し、必要に応じて更新し、HTTP `Authorization Bearer` スキーム値として設定します。
